# Rounding Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
AnalysisDisplayLegendSettings..::..Rounding Property
AnalysisDisplayLegendSettings Class See Also
---
Rounding increment for numeric values of analysis results.
**Namespace:** Autodesk.Revit.DB.Analysis**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2011
# Syntax
C#
---
```text
public double Rounding { get; set; }
```

Visual Basic
---
```text
Public Property Rounding As Double
	Get
	Set
```

Visual C++
---
```text
public:
property double Rounding {
	double get ();
	void set (double value);
}
```

# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentsInconsistentException | When setting this property: rounding is not positive |

# See Also
AnalysisDisplayLegendSettings Class
Autodesk.Revit.DB.Analysis Namespace